app/controllers/sessions_controller.rb

	def create
		@vendor = Vendor.find_by(email: params[:session][:email].downcase)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."email" = ? LIMIT 1  [["email", "camposmj89@gmail.com"]]