app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def create
    @vendor = Vendor.new(vendor_params)

    respond_to do |format|
      if @vendor.save
---
INSERT INTO "vendors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "brandon"], ["created_at", "2016-02-27 11:53:35.457289"], ["updated_at", "2016-02-27 11:53:35.457289"]]

    def set_vendor
      @vendor = Vendor.find(params[:id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]